{
  "analysis_summary": {
    "timestamp": "2025-05-31 20:09:34",
    "total_files_processed": 1,
    "total_vocabulary_items": 510,
    "unique_words": 407,
    "duplicate_words": 103
  },
  "file_breakdown": {
    "1": {
      "count": 510,
      "file": "vietnamese_raw_1.json"
    }
  },
  "linguistic_analysis": {
    "etymology": {
      "etymology_distribution": {
        "sino_vietnamese": 381,
        "native_vietnamese": 126,
        "unknown": 0,
        "other": 3
      },
      "etymology_details": {
        "sino_vietnamese": [
          "yêu",
          "bố",
          "bố",
          "bar",
          "ngày",
          "trăm",
          "lớp",
          "nửa",
          "nửa ngày",
          "giúp",
          "bao",
          "bánh bao",
          "cốc",
          "cốc",
          "bắc",
          "phía bắc",
          "Bắc Kinh",
          "cuốn",
          "sách",
          "Bỉ",
          "biệt",
          "người khác",
          "bệnh",
          "bệnh nhân",
          "không",
          "món",
          "trà",
          "chênh lệch",
          "thường",
          "thường",
          "hát",
          "ca hát",
          "xe",
          "vé",
          "xe",
          "trạm",
          "ăn",
          "ra",
          "đi ra",
          "mặc",
          "giường",
          "thứ",
          "theo",
          "sai",
          "đập",
          "gọi điện",
          "mở",
          "chơi bóng",
          "lớn",
          "đại học",
          "sinh viên",
          "đến",
          "địa điểm",
          "địa phương",
          "bản đồ",
          "của",
          "nhận được",
          "chờ",
          "em trai",
          "em trai",
          "thứ",
          "thứ",
          "điểm",
          "điện",
          "điện thoại",
          "máy tính",
          "ti vi",
          "máy truyền hình",
          "phim",
          "rạp",
          "đông",
          "phía đông",
          "động",
          "hành động",
          "cả",
          "đọc",
          "xin lỗi",
          "nhiều",
          "bao nhiêu",
          "no",
          "con trai",
          "cơm",
          "nhà hàng",
          "phòng",
          "thả",
          "nghỉ phép",
          "tan học",
          "bay",
          "máy bay",
          "phân",
          "gió",
          "khô",
          "sạch",
          "cao",
          "vui",
          "anhsao",
          "anh trai",
          "bài hát",
          "cho",
          "theo",
          "công nhân",
          "công việc",
          "khóa",
          "đắt",
          "quốc",
          "nước",
          "nước ngoài",
          "qua",
          "vẫn",
          "tiếng Trung",
          "hán tự",
          "nghe hay",
          "hào",
          "uống",
          "và",
          "rất",
          "sau",
          "hoa",
          "lời",
          "tệ",
          "về",
          "trả lời",
          "trở lại",
          "tàu hỏa",
          "sân bay",
          "vé máy bay",
          "ghi",
          "nhớ",
          "nhớ",
          "gia",
          "người thân",
          "giữa",
          "nhìn",
          "gặp mặt",
          "gọi",
          "dạy",
          "nhà học",
          "giới thiệu",
          "chị",
          "chị",
          "năm nay",
          "hôm nay",
          "vào",
          "chín",
          "thì",
          "cảm thấy",
          "lái xe",
          "đi họp",
          "nhìn",
          "khám bệnh",
          "thấy",
          "nhìn thấy",
          "thi",
          "kỳ thi",
          "khát",
          "bài",
          "sách giáo khoa",
          "bài đọc",
          "miệng",
          "miếng",
          "nhanh",
          "đến",
          "lão",
          "người già",
          "xong",
          "mệt",
          "lạnh",
          "hai",
          "không",
          "sáu",
          "lầu",
          "dưới đây",
          "đường",
          "giao lộ",
          "trên đường",
          "mẹ",
          "đường",
          "tức thì",
          "mua",
          "chậm",
          "bận",
          "tóc",
          "không có",
          "em",
          "em",
          "cửa",
          "vé vào",
          "các",
          "cơm",
          "bánh mì",
          "mì",
          "tên",
          "hiểu",
          "năm sau",
          "ngày mai",
          "lấy",
          "nào",
          "ở đâu",
          "đó",
          "những",
          "sữa",
          "bà",
          "nam",
          "bạn trai",
          "người đàn ông",
          "nam",
          "khó",
          "khả năng",
          "bạn",
          "năm",
          "nữ",
          "nữ nhân",
          "bên cạnh",
          "chạy",
          "bạn",
          "phiếu",
          "khởi động",
          "tỉnh dậy",
          "dậy",
          "xe hơi",
          "trước",
          "tiền",
          "ví",
          "xin",
          "nghỉ phép",
          "xin hỏi",
          "cầu",
          "đi",
          "năm ngoái",
          "nóng",
          "người",
          "biết",
          "nghiêm túc",
          "ngày",
          "ngày",
          "thịt",
          "núi",
          "siêu thị",
          "cửa hàng",
          "trên",
          "đi làm",
          "tải xe",
          "lần trước",
          "đi lớp",
          "truy cập",
          "ít",
          "thân thể",
          "bị bệnh",
          "tức giận",
          "sinh nhật",
          "mười",
          "thời gian",
          "thời gian",
          "việc",
          "thử",
          "là",
          "điện thoại di động",
          "sách",
          "túi xách",
          "cửa hàng sách",
          "cây",
          "nước",
          "trái cây",
          "ngủ",
          "nói",
          "nói",
          "gửi",
          "tuổi",
          "anh",
          "cô",
          "rất",
          "trời",
          "thời tiết",
          "nghe",
          "nghe",
          "nghe",
          "nghe viết",
          "bạn học",
          "thư viện",
          "ngoài",
          "ngoại ngữ",
          "cơm tối",
          "tối",
          "trực tuyến",
          "người dùng",
          "quên",
          "quên",
          "hỏi",
          "tôi",
          "chúng ta",
          "năm",
          "cơm trưa",
          "rửa",
          "thích",
          "tây",
          "xuống",
          "tan ca",
          "dưới",
          "xuống xe",
          "lần sau",
          "tan hoc",
          "chiều",
          "mưa",
          "trước",
          "thầy",
          "bây giờ",
          "tưởng",
          "nhỏ",
          "trẻ con",
          "giờ",
          "tiểu học",
          "học sinh",
          "cười",
          "viết",
          "mới",
          "tết",
          "chủ nhật",
          "nghỉ",
          "học",
          "học sinh",
          "học",
          "trường học",
          "trường",
          "muốn",
          "cũng",
          "trang",
          "nửa",
          "một bên",
          "một chút",
          "cùng",
          "xuống",
          "một số",
          "cùng",
          "trang phục",
          "bác sĩ",
          "bệnh viện",
          "dùng",
          "có",
          "nổi tiếng",
          "thỉnh thoảng",
          "có ích",
          "phải",
          "phía phải",
          "mưa",
          "xa",
          "trăng",
          "lại",
          "tạm biệt",
          "ở",
          "sớm",
          "bữa sáng",
          "sáng sớm",
          "thế nào",
          "ga",
          "tìm",
          "tìm thấy",
          "này",
          "chuyển",
          "thật",
          "thẳng",
          "kiến thức",
          "trung",
          "Trung Quốc",
          "tiếng Trung",
          "trung học",
          "học sinh trung học",
          "nặng",
          "quan trọng",
          "ở",
          "chuẩn bị",
          "bàn",
          "chữ",
          "đi",
          "đi bộ",
          "nhất",
          "tốt nhất",
          "hôm qua",
          "trái",
          "tọa",
          "ngồi xuống",
          "làm"
        ],
        "native_vietnamese": [
          "thích",
          "tám",
          "trắng",
          "nửa năm",
          "khác",
          "không",
          "sai",
          "không sao",
          "không cần",
          "ăn",
          "ra",
          "đi taxi",
          "đất",
          "trên mặt đất",
          "hai",
          "vật",
          "học",
          "đúng",
          "hai",
          "nhà",
          "rất",
          "làm gì",
          "nói",
          "một",
          "đóng",
          "vẫn",
          "còn nữa",
          "trẻ",
          "tốt",
          "ngon",
          "xinh",
          "vui",
          "sau",
          "ngày mai mai",
          "về nhà",
          "về",
          "về",
          "gặp",
          "trứng",
          "mấy",
          "nhà",
          "vào",
          "vào",
          "mở",
          "đùa",
          "đến",
          "thầy",
          "trong",
          "trong",
          "trên",
          "mẹ",
          "không",
          "không",
          "không sao",
          "không sao",
          "không sao",
          "cửa",
          "các",
          "nơi nào",
          "nào",
          "phía kia",
          "đó",
          "nơi đó",
          "trai",
          "trai",
          "phía nam",
          "à",
          "các bạn",
          "bạn",
          "con gái",
          "cô gái",
          "người yêu",
          "cô gái",
          "bảy",
          "trước",
          "ngày qua",
          "xin mời",
          "xin ngồi",
          "ba",
          "trên",
          "sáng",
          "đi học",
          "trên người",
          "gì",
          "có phải không",
          "tay",
          "ai",
          "ngủ",
          "bốn",
          "họ",
          "họ",
          "ngoài",
          "nước ngoài",
          "chơi",
          "tối",
          "phòng vệ sinh",
          "tây",
          "trẻ con",
          "cô",
          "cảm ơn",
          "đi",
          "ông nội",
          "một",
          "một lúc",
          "cùng nhau",
          "có",
          "đôi khi",
          "một chút",
          "một chút",
          "một chút",
          "một",
          "ở nhà",
          "phía này",
          "đây",
          "ở đây",
          "này",
          "thật",
          "đang",
          "biết",
          "giữa",
          "trưa",
          "bàn",
          "con",
          "con",
          "cuối cùng",
          "trái"
        ],
        "french_loanword": [
          "sữa",
          "chủ nhật",
          "chủ nhật"
        ]
      },
      "source_languages": {
        "chinese": 402,
        "unknown": 81,
        "Chinese": 19,
        "vietnamese": 6,
        "french": 2
      }
    },
    "tone_patterns": {
      "tone_distribution": {
        "low_falling": 9,
        "low": 7,
        "low_rising": 183,
        "high_level": 32,
        "rising": 35,
        "falling": 41,
        "mid_rising": 8,
        "low_low": 5,
        "low_rising, high_level": 7,
        "high_level_tone": 1,
        "low_level_rising": 1,
        "high_level, high_rising": 1,
        "mid_mid": 2,
        "mid_level": 8,
        "high": 26,
        "mid-rising, low-rising": 1,
        "mid_tone": 3,
        "mid": 1,
        "high_level low_rising": 1,
        "low_rising, rising": 2,
        "low_rising, falling_rising": 1,
        "low_rising_falling_rising": 1,
        "falling_rising": 5,
        "low_rising, falling": 2,
        "mid_low_mid_high": 1,
        "falling_tone": 3,
        "low_tone_falling_rising": 1,
        "low then rising": 2,
        "rising_falling_rising": 1,
        "low_rising, low_rising, high_falling": 1,
        "falling-rising": 3,
        "low_tone": 6,
        "rising_tone": 3,
        "rising, high_level": 1,
        "low_rising_falling": 3,
        "high_falling": 2,
        "low_rising then high_falling": 3,
        "low_rising, high_falling": 6,
        "high_rising": 3,
        "monotonic_low": 1,
        "low_rising then falling_rising": 1,
        "mid_low": 2,
        "high_level_low_rising": 2,
        "mid_high_low_falling": 1,
        "level tone for both syllables": 1,
        "low_rising followed by high_falling": 1,
        "rising tone": 1,
        "low_rising_low_rising": 2,
        "rising_rising": 1,
        "mid_falling": 9,
        "low_rising_high_falling": 2,
        "low_high": 1,
        "high level then falling-rising": 1,
        "mid-level tone": 1,
        "high_level_rising": 1,
        "low_rising high_level": 1,
        "low_mid": 1,
        "level_level": 1,
        "low_mid_falling": 1,
        "low_flat": 2,
        "high_tone": 2,
        "high_high": 1,
        "falling_rising_high": 2,
        "high_level followed by low_rising": 1,
        "low_rising_low_falling": 1,
        "low then high level": 1,
        "low_level": 1,
        "low_rising_mid_level": 1,
        "low_flat then low_rising": 2,
        "mid_rising then low_falling": 1,
        "falling_low_rising": 1,
        "low_rising_mid_rising": 2,
        "mid_level_tone": 1,
        "low then high": 2,
        "low_rising high_falling": 1,
        "falling then rising": 1,
        "low_rising_high_level": 3,
        "low_rising for 'đi' and neutral for 'lớp'": 1,
        "level": 1,
        "low_mid_tone": 1,
        "low_rising, falling_rising, low_rising": 1,
        "low-rise, low-rise, rising, low-rise": 1,
        "rising_high": 1,
        "third tone then fourth tone": 1,
        "mid-falling": 2,
        "falling, rising, rising": 1,
        "mid_rise": 1,
        "rising then falling": 2,
        "low_rising then mid_level": 1,
        "low_rising, high_rising": 1,
        "low_rising mid_rising": 2,
        "high_level, low_falling": 1,
        "low_rising and high_level": 1,
        "low_rise_falling": 1,
        "low_rising mid_level": 1,
        "low_rising_low": 1,
        "high_falling_rising": 1,
        "low_rising then falling": 2,
        "high_level, high_level": 1,
        "rising_falling": 1,
        "level 3 (rising), level 5 (falling), level 3 (rising), level 5 (falling)": 1,
        "low_flat then falling": 1,
        "high, falling-rising": 1
      },
      "tone_details": {
        "low_falling": [
          "yêu",
          "nhà",
          "vào",
          "mẹ",
          "các",
          "nào",
          "ngoài",
          "trước",
          "viết"
        ],
        "low": [
          "thích",
          "hai",
          "nước",
          "không",
          "anh",
          "quên",
          "ga"
        ],
        "low_rising": [
          "tám",
          "trắng",
          "lớp",
          "nửa",
          "bao",
          "cốc",
          "cuốn",
          "biệt",
          "khác",
          "bệnh",
          "không",
          "không",
          "sai",
          "món",
          "hát",
          "trạm",
          "đi ra",
          "mặc",
          "thứ",
          "theo",
          "sai",
          "đập",
          "đi taxi",
          "gọi điện",
          "mở",
          "lớn",
          "đất",
          "trên mặt đất",
          "của",
          "chờ",
          "em trai",
          "thứ",
          "điểm",
          "điện",
          "rạp",
          "vật",
          "cả",
          "đúng",
          "xin lỗi",
          "no",
          "hai",
          "phòng",
          "thả",
          "rất",
          "khô",
          "sạch",
          "nói",
          "anhsao",
          "bài hát",
          "cho",
          "đắt",
          "quốc",
          "vẫn",
          "vẫn",
          "trẻ",
          "tốt",
          "uống",
          "và",
          "rất",
          "sau",
          "sau",
          "trở lại",
          "gặp",
          "trứng",
          "giữa",
          "gọi",
          "dạy",
          "chị",
          "hôm nay",
          "mở",
          "đi họp",
          "thấy",
          "khát",
          "miệng",
          "miếng",
          "đến",
          "lão",
          "mệt",
          "lạnh",
          "trong",
          "hai",
          "dưới đây",
          "trên đường",
          "mẹ",
          "tức thì",
          "chậm",
          "tóc",
          "cửa",
          "cửa",
          "bánh mì",
          "hiểu",
          "lấy",
          "ở đâu",
          "đó",
          "đó",
          "những",
          "sữa",
          "trai",
          "bạn",
          "bạn",
          "sữa",
          "nữ",
          "nữ nhân",
          "cô gái",
          "chạy",
          "bạn",
          "bảy",
          "khởi động",
          "trước",
          "trước",
          "nghỉ phép",
          "nóng",
          "biết",
          "thịt",
          "ba",
          "núi",
          "truy cập",
          "ít",
          "thân thể",
          "gì",
          "tức giận",
          "việc",
          "thử",
          "là",
          "cửa hàng sách",
          "ai",
          "trái cây",
          "ngủ",
          "ngủ",
          "nói",
          "nói",
          "bốn",
          "gửi",
          "tuổi",
          "rất",
          "nghe viết",
          "nước ngoài",
          "tối",
          "tối",
          "trực tuyến",
          "người dùng",
          "hỏi",
          "dưới",
          "mưa",
          "trẻ con",
          "cảm ơn",
          "mới",
          "chủ nhật",
          "đi",
          "nghỉ",
          "học",
          "muốn",
          "cũng",
          "nửa",
          "một lúc",
          "cùng",
          "một chút",
          "phải",
          "phía phải",
          "một",
          "xa",
          "trăng",
          "lại",
          "ở nhà",
          "sớm",
          "này",
          "chuyển",
          "thẳng",
          "kiến thức",
          "Trung Quốc",
          "trung học",
          "ở",
          "chuẩn bị",
          "bàn",
          "bàn",
          "chữ",
          "con",
          "đi",
          "nhất",
          "cuối cùng",
          "trái",
          "trái",
          "tọa"
        ],
        "high_level": [
          "bố",
          "bố",
          "bar",
          "bắc",
          "xe",
          "giường",
          "nhiều",
          "nhà hàng",
          "tan học",
          "hoa",
          "tệ",
          "năm nay",
          "thi",
          "không",
          "sáu",
          "lầu",
          "trên",
          "em",
          "ngày mai",
          "nam",
          "dậy",
          "tiền",
          "cầu",
          "cửa hàng",
          "trên",
          "ngoài",
          "chơi",
          "rửa",
          "tây",
          "nhỏ",
          "dùng",
          "tìm"
        ],
        "rising": [
          "ngày",
          "giúp",
          "cốc",
          "sách",
          "trà",
          "vé",
          "đông",
          "đọc",
          "học",
          "phân",
          "gió",
          "theo",
          "chị",
          "đùa",
          "nhìn",
          "thầy",
          "đường",
          "mua",
          "trai",
          "phiếu",
          "ngày qua",
          "đi",
          "mười",
          "thời gian",
          "cây",
          "tôi",
          "thích",
          "cô",
          "cười",
          "học",
          "trang",
          "cùng",
          "có",
          "một chút",
          "này"
        ],
        "falling": [
          "trăm",
          "Bỉ",
          "đến",
          "cơm",
          "nhà",
          "vui",
          "đóng",
          "ngon",
          "vui",
          "về",
          "về",
          "mấy",
          "nhớ",
          "nhìn",
          "chín",
          "đến",
          "trong",
          "các",
          "mì",
          "nào",
          "bà",
          "à",
          "ví",
          "người",
          "ngày",
          "sáng",
          "sách",
          "nước",
          "cô",
          "họ",
          "nghe",
          "nghe",
          "xuống",
          "xuống",
          "mưa",
          "ở đây",
          "biết",
          "trung",
          "giữa",
          "trưa",
          "con"
        ],
        "mid_rising": [
          "nửa năm",
          "phim",
          "qua",
          "ngày mai mai",
          "vé máy bay",
          "thì",
          "không sao",
          "thật"
        ],
        "low_low": [
          "nửa ngày",
          "bệnh nhân",
          "chênh lệch",
          "địa phương",
          "lái xe"
        ],
        "low_rising, high_level": [
          "bánh bao",
          "không sao",
          "nghỉ phép",
          "tiếng Trung",
          "nơi nào",
          "một chút",
          "bữa sáng"
        ],
        "high_level_tone": [
          "phía bắc"
        ],
        "low_level_rising": [
          "Bắc Kinh"
        ],
        "high_level, high_rising": [
          "người khác"
        ],
        "mid_mid": [
          "không cần",
          "tải xe"
        ],
        "mid_level": [
          "thường",
          "về",
          "sách giáo khoa",
          "xin",
          "trời",
          "bạn học",
          "học sinh",
          "đây"
        ],
        "high": [
          "thường",
          "xe",
          "ăn",
          "một",
          "khóa",
          "xinh",
          "hào",
          "lời",
          "gia",
          "bài",
          "nhanh",
          "xong",
          "đường",
          "em",
          "cơm",
          "nam",
          "ngày",
          "trên",
          "tay",
          "họ",
          "quên",
          "năm",
          "thầy",
          "một",
          "ở",
          "thật"
        ],
        "mid-rising, low-rising": [
          "ca hát"
        ],
        "mid_tone": [
          "ăn",
          "ra",
          "có"
        ],
        "mid": [
          "ra"
        ],
        "high_level low_rising": [
          "chơi bóng"
        ],
        "low_rising, rising": [
          "đại học",
          "người già"
        ],
        "low_rising, falling_rising": [
          "sinh viên"
        ],
        "low_rising_falling_rising": [
          "địa điểm"
        ],
        "falling_rising": [
          "bản đồ",
          "nhà học",
          "con gái",
          "xuống xe",
          "ngồi xuống"
        ],
        "low_rising, falling": [
          "nhận được",
          "gặp mặt"
        ],
        "mid_low_mid_high": [
          "em trai"
        ],
        "falling_tone": [
          "thứ",
          "tết",
          "hôm qua"
        ],
        "low_tone_falling_rising": [
          "điện thoại"
        ],
        "low then rising": [
          "máy tính",
          "xin hỏi"
        ],
        "rising_falling_rising": [
          "ti vi"
        ],
        "low_rising, low_rising, high_falling": [
          "máy truyền hình"
        ],
        "falling-rising": [
          "phía đông",
          "chúng ta",
          "phía này"
        ],
        "low_tone": [
          "động",
          "vào",
          "bận",
          "tây",
          "cùng nhau",
          "nặng"
        ],
        "rising_tone": [
          "hành động",
          "bạn trai",
          "năm ngoái"
        ],
        "rising, high_level": [
          "bao nhiêu"
        ],
        "low_rising_falling": [
          "con trai",
          "khám bệnh",
          "tìm thấy"
        ],
        "high_falling": [
          "bay",
          "không"
        ],
        "low_rising then high_falling": [
          "máy bay",
          "đôi khi",
          "có ích"
        ],
        "low_rising, high_falling": [
          "làm gì",
          "xe hơi",
          "thư viện",
          "cơm trưa",
          "nổi tiếng",
          "tạm biệt"
        ],
        "high_rising": [
          "cao",
          "ghi",
          "thời tiết"
        ],
        "monotonic_low": [
          "anh trai"
        ],
        "low_rising then falling_rising": [
          "công nhân"
        ],
        "mid_low": [
          "công việc",
          "trường"
        ],
        "high_level_low_rising": [
          "nước ngoài",
          "hán tự"
        ],
        "mid_high_low_falling": [
          "còn nữa"
        ],
        "level tone for both syllables": [
          "nghe hay"
        ],
        "low_rising followed by high_falling": [
          "trả lời"
        ],
        "rising tone": [
          "về nhà"
        ],
        "low_rising_low_rising": [
          "tàu hỏa",
          "đi học"
        ],
        "rising_rising": [
          "sân bay"
        ],
        "mid_falling": [
          "nhớ",
          "vào",
          "khó",
          "năm",
          "chiều",
          "tưởng",
          "giờ",
          "đang",
          "làm"
        ],
        "low_rising_high_falling": [
          "người thân",
          "giới thiệu"
        ],
        "low_high": [
          "cảm thấy"
        ],
        "high level then falling-rising": [
          "nhìn thấy"
        ],
        "mid-level tone": [
          "kỳ thi"
        ],
        "high_level_rising": [
          "bài đọc"
        ],
        "low_rising high_level": [
          "giao lộ"
        ],
        "low_mid": [
          "không sao"
        ],
        "level_level": [
          "không sao"
        ],
        "low_mid_falling": [
          "không có"
        ],
        "low_flat": [
          "vé vào",
          "bị bệnh"
        ],
        "high_tone": [
          "tên",
          "nghe"
        ],
        "high_high": [
          "năm sau"
        ],
        "falling_rising_high": [
          "phía kia",
          "người yêu"
        ],
        "high_level followed by low_rising": [
          "nơi đó"
        ],
        "low_rising_low_falling": [
          "người đàn ông"
        ],
        "low then high level": [
          "phía nam"
        ],
        "low_level": [
          "khả năng"
        ],
        "low_rising_mid_level": [
          "các bạn"
        ],
        "low_flat then low_rising": [
          "cô gái",
          "bệnh viện"
        ],
        "mid_rising then low_falling": [
          "bên cạnh"
        ],
        "falling_low_rising": [
          "tỉnh dậy"
        ],
        "low_rising_mid_rising": [
          "xin mời",
          "học sinh"
        ],
        "mid_level_tone": [
          "xin ngồi"
        ],
        "low then high": [
          "nghiêm túc",
          "sinh nhật"
        ],
        "low_rising high_falling": [
          "siêu thị"
        ],
        "falling then rising": [
          "đi làm"
        ],
        "low_rising_high_level": [
          "lần trước",
          "tan ca",
          "bây giờ"
        ],
        "low_rising for 'đi' and neutral for 'lớp'": [
          "đi lớp"
        ],
        "level": [
          "trên người"
        ],
        "low_mid_tone": [
          "thời gian"
        ],
        "low_rising, falling_rising, low_rising": [
          "có phải không"
        ],
        "low-rise, low-rise, rising, low-rise": [
          "điện thoại di động"
        ],
        "rising_high": [
          "túi xách"
        ],
        "third tone then fourth tone": [
          "ngoại ngữ"
        ],
        "mid-falling": [
          "cơm tối",
          "một số"
        ],
        "falling, rising, rising": [
          "phòng vệ sinh"
        ],
        "mid_rise": [
          "lần sau"
        ],
        "rising then falling": [
          "tan hoc",
          "một chút"
        ],
        "low_rising then mid_level": [
          "trẻ con"
        ],
        "low_rising, high_rising": [
          "tiểu học"
        ],
        "low_rising mid_rising": [
          "chủ nhật",
          "tiếng Trung"
        ],
        "high_level, low_falling": [
          "chủ nhật"
        ],
        "low_rising and high_level": [
          "trường học"
        ],
        "low_rise_falling": [
          "ông nội"
        ],
        "low_rising mid_level": [
          "một bên"
        ],
        "low_rising_low": [
          "trang phục"
        ],
        "high_falling_rising": [
          "bác sĩ"
        ],
        "low_rising then falling": [
          "thỉnh thoảng",
          "đi bộ"
        ],
        "high_level, high_level": [
          "sáng sớm"
        ],
        "rising_falling": [
          "thế nào"
        ],
        "level 3 (rising), level 5 (falling), level 3 (rising), level 5 (falling)": [
          "học sinh trung học"
        ],
        "low_flat then falling": [
          "quan trọng"
        ],
        "high, falling-rising": [
          "tốt nhất"
        ]
      }
    },
    "regional_variants": {
      "regional_differences": {
        "north_central": 3,
        "north_south": 4,
        "central_south": 3
      },
      "variant_examples": {
        "north_central": [
          {
            "word": "kỳ thi",
            "northern": "kỳ thi",
            "central": "ky thi"
          },
          {
            "word": "vé vào",
            "northern": "vé vào",
            "central": "vé vao"
          },
          {
            "word": "xin hỏi",
            "northern": "xin hỏi",
            "central": "xin hoi"
          }
        ],
        "north_south": [
          {
            "word": "kỳ thi",
            "northern": "kỳ thi",
            "southern": "ky thi"
          },
          {
            "word": "xe hơi",
            "northern": "xe hơi",
            "southern": "xe hoi"
          },
          {
            "word": "xin hỏi",
            "northern": "xin hỏi",
            "southern": "xin hoi"
          },
          {
            "word": "một",
            "northern": "một",
            "southern": "mốt"
          }
        ],
        "central_south": [
          {
            "word": "vé vào",
            "central": "vé vao",
            "southern": "vé vào"
          },
          {
            "word": "xe hơi",
            "central": "xe hơi",
            "southern": "xe hoi"
          },
          {
            "word": "một",
            "central": "một",
            "southern": "mốt"
          }
        ]
      }
    },
    "syllable_structure": {
      "syllable_distribution": {
        "1": 316,
        "2": 183,
        "3": 9,
        "4": 2
      },
      "syllable_details": {
        "1": [
          {
            "word": "yêu",
            "syllables": [
              "yêu"
            ]
          },
          {
            "word": "thích",
            "syllables": [
              "thích"
            ]
          },
          {
            "word": "tám",
            "syllables": [
              "tám"
            ]
          },
          {
            "word": "bố",
            "syllables": [
              "bố"
            ]
          },
          {
            "word": "bố",
            "syllables": [
              "bố"
            ]
          },
          {
            "word": "bar",
            "syllables": [
              "bar"
            ]
          },
          {
            "word": "trắng",
            "syllables": [
              "trắng"
            ]
          },
          {
            "word": "ngày",
            "syllables": [
              "ngày"
            ]
          },
          {
            "word": "trăm",
            "syllables": [
              "trăm"
            ]
          },
          {
            "word": "lớp",
            "syllables": [
              "lớp"
            ]
          },
          {
            "word": "nửa",
            "syllables": [
              "nửa"
            ]
          },
          {
            "word": "giúp",
            "syllables": [
              "giúp"
            ]
          },
          {
            "word": "bao",
            "syllables": [
              "bao"
            ]
          },
          {
            "word": "cốc",
            "syllables": [
              "cốc"
            ]
          },
          {
            "word": "cốc",
            "syllables": [
              "cốc"
            ]
          },
          {
            "word": "bắc",
            "syllables": [
              "bắc"
            ]
          },
          {
            "word": "cuốn",
            "syllables": [
              "cuốn"
            ]
          },
          {
            "word": "sách",
            "syllables": [
              "sách"
            ]
          },
          {
            "word": "Bỉ",
            "syllables": [
              "Bỉ"
            ]
          },
          {
            "word": "biệt",
            "syllables": [
              "biệt"
            ]
          },
          {
            "word": "khác",
            "syllables": [
              "khác"
            ]
          },
          {
            "word": "bệnh",
            "syllables": [
              "bệnh"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "sai",
            "syllables": [
              "sai"
            ]
          },
          {
            "word": "món",
            "syllables": [
              "món"
            ]
          },
          {
            "word": "trà",
            "syllables": [
              "trà"
            ]
          },
          {
            "word": "thường",
            "syllables": [
              "thường"
            ]
          },
          {
            "word": "thường",
            "syllables": [
              "thường"
            ]
          },
          {
            "word": "hát",
            "syllables": [
              "hát"
            ]
          },
          {
            "word": "xe",
            "syllables": [
              "xe"
            ]
          },
          {
            "word": "vé",
            "syllables": [
              "vé"
            ]
          },
          {
            "word": "xe",
            "syllables": [
              "xe"
            ]
          },
          {
            "word": "trạm",
            "syllables": [
              "trạm"
            ]
          },
          {
            "word": "ăn",
            "syllables": [
              "ăn"
            ]
          },
          {
            "word": "ăn",
            "syllables": [
              "ăn"
            ]
          },
          {
            "word": "ra",
            "syllables": [
              "ra"
            ]
          },
          {
            "word": "ra",
            "syllables": [
              "ra"
            ]
          },
          {
            "word": "mặc",
            "syllables": [
              "mặc"
            ]
          },
          {
            "word": "giường",
            "syllables": [
              "giường"
            ]
          },
          {
            "word": "thứ",
            "syllables": [
              "thứ"
            ]
          },
          {
            "word": "theo",
            "syllables": [
              "theo"
            ]
          },
          {
            "word": "sai",
            "syllables": [
              "sai"
            ]
          },
          {
            "word": "đập",
            "syllables": [
              "đập"
            ]
          },
          {
            "word": "mở",
            "syllables": [
              "mở"
            ]
          },
          {
            "word": "lớn",
            "syllables": [
              "lớn"
            ]
          },
          {
            "word": "đến",
            "syllables": [
              "đến"
            ]
          },
          {
            "word": "đất",
            "syllables": [
              "đất"
            ]
          },
          {
            "word": "của",
            "syllables": [
              "của"
            ]
          },
          {
            "word": "chờ",
            "syllables": [
              "chờ"
            ]
          },
          {
            "word": "thứ",
            "syllables": [
              "thứ"
            ]
          },
          {
            "word": "thứ",
            "syllables": [
              "thứ"
            ]
          },
          {
            "word": "hai",
            "syllables": [
              "hai"
            ]
          },
          {
            "word": "điểm",
            "syllables": [
              "điểm"
            ]
          },
          {
            "word": "điện",
            "syllables": [
              "điện"
            ]
          },
          {
            "word": "phim",
            "syllables": [
              "phim"
            ]
          },
          {
            "word": "rạp",
            "syllables": [
              "rạp"
            ]
          },
          {
            "word": "đông",
            "syllables": [
              "đông"
            ]
          },
          {
            "word": "vật",
            "syllables": [
              "vật"
            ]
          },
          {
            "word": "động",
            "syllables": [
              "động"
            ]
          },
          {
            "word": "cả",
            "syllables": [
              "cả"
            ]
          },
          {
            "word": "đọc",
            "syllables": [
              "đọc"
            ]
          },
          {
            "word": "học",
            "syllables": [
              "học"
            ]
          },
          {
            "word": "đúng",
            "syllables": [
              "đúng"
            ]
          },
          {
            "word": "nhiều",
            "syllables": [
              "nhiều"
            ]
          },
          {
            "word": "no",
            "syllables": [
              "no"
            ]
          },
          {
            "word": "hai",
            "syllables": [
              "hai"
            ]
          },
          {
            "word": "cơm",
            "syllables": [
              "cơm"
            ]
          },
          {
            "word": "phòng",
            "syllables": [
              "phòng"
            ]
          },
          {
            "word": "nhà",
            "syllables": [
              "nhà"
            ]
          },
          {
            "word": "thả",
            "syllables": [
              "thả"
            ]
          },
          {
            "word": "bay",
            "syllables": [
              "bay"
            ]
          },
          {
            "word": "rất",
            "syllables": [
              "rất"
            ]
          },
          {
            "word": "phân",
            "syllables": [
              "phân"
            ]
          },
          {
            "word": "gió",
            "syllables": [
              "gió"
            ]
          },
          {
            "word": "khô",
            "syllables": [
              "khô"
            ]
          },
          {
            "word": "sạch",
            "syllables": [
              "sạch"
            ]
          },
          {
            "word": "cao",
            "syllables": [
              "cao"
            ]
          },
          {
            "word": "vui",
            "syllables": [
              "vui"
            ]
          },
          {
            "word": "nói",
            "syllables": [
              "nói"
            ]
          },
          {
            "word": "một",
            "syllables": [
              "một"
            ]
          },
          {
            "word": "cho",
            "syllables": [
              "cho"
            ]
          },
          {
            "word": "theo",
            "syllables": [
              "theo"
            ]
          },
          {
            "word": "khóa",
            "syllables": [
              "khóa"
            ]
          },
          {
            "word": "đóng",
            "syllables": [
              "đóng"
            ]
          },
          {
            "word": "đắt",
            "syllables": [
              "đắt"
            ]
          },
          {
            "word": "quốc",
            "syllables": [
              "quốc"
            ]
          },
          {
            "word": "nước",
            "syllables": [
              "nước"
            ]
          },
          {
            "word": "qua",
            "syllables": [
              "qua"
            ]
          },
          {
            "word": "vẫn",
            "syllables": [
              "vẫn"
            ]
          },
          {
            "word": "vẫn",
            "syllables": [
              "vẫn"
            ]
          },
          {
            "word": "trẻ",
            "syllables": [
              "trẻ"
            ]
          },
          {
            "word": "tốt",
            "syllables": [
              "tốt"
            ]
          },
          {
            "word": "ngon",
            "syllables": [
              "ngon"
            ]
          },
          {
            "word": "xinh",
            "syllables": [
              "xinh"
            ]
          },
          {
            "word": "vui",
            "syllables": [
              "vui"
            ]
          },
          {
            "word": "hào",
            "syllables": [
              "hào"
            ]
          },
          {
            "word": "uống",
            "syllables": [
              "uống"
            ]
          },
          {
            "word": "và",
            "syllables": [
              "và"
            ]
          },
          {
            "word": "rất",
            "syllables": [
              "rất"
            ]
          },
          {
            "word": "sau",
            "syllables": [
              "sau"
            ]
          },
          {
            "word": "sau",
            "syllables": [
              "sau"
            ]
          },
          {
            "word": "hoa",
            "syllables": [
              "hoa"
            ]
          },
          {
            "word": "lời",
            "syllables": [
              "lời"
            ]
          },
          {
            "word": "tệ",
            "syllables": [
              "tệ"
            ]
          },
          {
            "word": "về",
            "syllables": [
              "về"
            ]
          },
          {
            "word": "về",
            "syllables": [
              "về"
            ]
          },
          {
            "word": "về",
            "syllables": [
              "về"
            ]
          },
          {
            "word": "gặp",
            "syllables": [
              "gặp"
            ]
          },
          {
            "word": "trứng",
            "syllables": [
              "trứng"
            ]
          },
          {
            "word": "mấy",
            "syllables": [
              "mấy"
            ]
          },
          {
            "word": "ghi",
            "syllables": [
              "ghi"
            ]
          },
          {
            "word": "nhớ",
            "syllables": [
              "nhớ"
            ]
          },
          {
            "word": "nhớ",
            "syllables": [
              "nhớ"
            ]
          },
          {
            "word": "gia",
            "syllables": [
              "gia"
            ]
          },
          {
            "word": "nhà",
            "syllables": [
              "nhà"
            ]
          },
          {
            "word": "giữa",
            "syllables": [
              "giữa"
            ]
          },
          {
            "word": "nhìn",
            "syllables": [
              "nhìn"
            ]
          },
          {
            "word": "gọi",
            "syllables": [
              "gọi"
            ]
          },
          {
            "word": "dạy",
            "syllables": [
              "dạy"
            ]
          },
          {
            "word": "chị",
            "syllables": [
              "chị"
            ]
          },
          {
            "word": "chị",
            "syllables": [
              "chị"
            ]
          },
          {
            "word": "vào",
            "syllables": [
              "vào"
            ]
          },
          {
            "word": "vào",
            "syllables": [
              "vào"
            ]
          },
          {
            "word": "vào",
            "syllables": [
              "vào"
            ]
          },
          {
            "word": "chín",
            "syllables": [
              "chín"
            ]
          },
          {
            "word": "thì",
            "syllables": [
              "thì"
            ]
          },
          {
            "word": "mở",
            "syllables": [
              "mở"
            ]
          },
          {
            "word": "đùa",
            "syllables": [
              "đùa"
            ]
          },
          {
            "word": "nhìn",
            "syllables": [
              "nhìn"
            ]
          },
          {
            "word": "thấy",
            "syllables": [
              "thấy"
            ]
          },
          {
            "word": "thi",
            "syllables": [
              "thi"
            ]
          },
          {
            "word": "khát",
            "syllables": [
              "khát"
            ]
          },
          {
            "word": "bài",
            "syllables": [
              "bài"
            ]
          },
          {
            "word": "miệng",
            "syllables": [
              "miệng"
            ]
          },
          {
            "word": "miếng",
            "syllables": [
              "miếng"
            ]
          },
          {
            "word": "nhanh",
            "syllables": [
              "nhanh"
            ]
          },
          {
            "word": "đến",
            "syllables": [
              "đến"
            ]
          },
          {
            "word": "đến",
            "syllables": [
              "đến"
            ]
          },
          {
            "word": "lão",
            "syllables": [
              "lão"
            ]
          },
          {
            "word": "thầy",
            "syllables": [
              "thầy"
            ]
          },
          {
            "word": "xong",
            "syllables": [
              "xong"
            ]
          },
          {
            "word": "mệt",
            "syllables": [
              "mệt"
            ]
          },
          {
            "word": "lạnh",
            "syllables": [
              "lạnh"
            ]
          },
          {
            "word": "trong",
            "syllables": [
              "trong"
            ]
          },
          {
            "word": "trong",
            "syllables": [
              "trong"
            ]
          },
          {
            "word": "hai",
            "syllables": [
              "hai"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "sáu",
            "syllables": [
              "sáu"
            ]
          },
          {
            "word": "lầu",
            "syllables": [
              "lầu"
            ]
          },
          {
            "word": "trên",
            "syllables": [
              "trên"
            ]
          },
          {
            "word": "đường",
            "syllables": [
              "đường"
            ]
          },
          {
            "word": "mẹ",
            "syllables": [
              "mẹ"
            ]
          },
          {
            "word": "mẹ",
            "syllables": [
              "mẹ"
            ]
          },
          {
            "word": "đường",
            "syllables": [
              "đường"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "mua",
            "syllables": [
              "mua"
            ]
          },
          {
            "word": "chậm",
            "syllables": [
              "chậm"
            ]
          },
          {
            "word": "bận",
            "syllables": [
              "bận"
            ]
          },
          {
            "word": "tóc",
            "syllables": [
              "tóc"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "em",
            "syllables": [
              "em"
            ]
          },
          {
            "word": "em",
            "syllables": [
              "em"
            ]
          },
          {
            "word": "cửa",
            "syllables": [
              "cửa"
            ]
          },
          {
            "word": "cửa",
            "syllables": [
              "cửa"
            ]
          },
          {
            "word": "các",
            "syllables": [
              "các"
            ]
          },
          {
            "word": "các",
            "syllables": [
              "các"
            ]
          },
          {
            "word": "cơm",
            "syllables": [
              "cơm"
            ]
          },
          {
            "word": "mì",
            "syllables": [
              "mì"
            ]
          },
          {
            "word": "tên",
            "syllables": [
              "tên"
            ]
          },
          {
            "word": "hiểu",
            "syllables": [
              "hiểu"
            ]
          },
          {
            "word": "lấy",
            "syllables": [
              "lấy"
            ]
          },
          {
            "word": "nào",
            "syllables": [
              "nào"
            ]
          },
          {
            "word": "nào",
            "syllables": [
              "nào"
            ]
          },
          {
            "word": "đó",
            "syllables": [
              "đó"
            ]
          },
          {
            "word": "đó",
            "syllables": [
              "đó"
            ]
          },
          {
            "word": "những",
            "syllables": [
              "những"
            ]
          },
