{
  "analysis_summary": {
    "timestamp": "2025-06-01 14:58:46",
    "total_files_processed": 1,
    "total_vocabulary_items": 511,
    "unique_words": 417,
    "duplicate_words": 94
  },
  "file_breakdown": {
    "1": {
      "count": 511,
      "file": "vietnamese_raw_1.json"
    }
  },
  "linguistic_analysis": {
    "etymology": {
      "etymology_distribution": {
        "sino_vietnamese": 375,
        "native_vietnamese": 135,
        "unknown": 0,
        "other": 1
      },
      "etymology_details": {
        "sino_vietnamese": [
          "yêu",
          "ba",
          "bố",
          "bar",
          "trắng",
          "ngày",
          "trăm",
          "lớp",
          "nửa",
          "nửa năm",
          "giúp",
          "bao",
          "bánh bao",
          "cốc",
          "bắc",
          "phía bắc",
          "Thành Đô",
          "bản",
          "so sánh",
          "biệt",
          "người khác",
          "bệnh",
          "bệnh nhân",
          "không quá",
          "không đúng",
          "rau",
          "trà",
          "thường",
          "hát",
          "xe",
          "ga",
          "ăn",
          "ăn cơm",
          "ra",
          "mặc",
          "giường",
          "thứ",
          "theo",
          "sai",
          "đập",
          "đi taxi",
          "gọi điện thoại",
          "mở",
          "đánh bóng",
          "lớn",
          "đại học",
          "sinh viên đại học",
          "bản đồ",
          "của",
          "nhận được",
          "chờ",
          "em",
          "thứ",
          "thứ",
          "thứ hai",
          "điểm",
          "điện",
          "điện thoại",
          "máy tính",
          "ti vi",
          "máy truyền hình",
          "phim",
          "rạp chiếu phim",
          "phía đông",
          "đồ",
          "động",
          "hành động",
          "đều",
          "đọc",
          "học",
          "xin lỗi",
          "nhiều",
          "no",
          "hai",
          "bữa ăn",
          "nhà hàng",
          "thả",
          "nghỉ phép",
          "tan hoc",
          "bay",
          "máy bay",
          "gió",
          "khô",
          "sạch",
          "bạn đang làm gì",
          "cao",
          "nói",
          "anhsao",
          "bài hát",
          "cho",
          "theo",
          "công nhân",
          "công việc",
          "khép",
          "đóng",
          "đắt",
          "quốc",
          "quốc gia",
          "nước ngoài",
          "qua",
          "vẫn",
          "vẫn",
          "trẻ",
          "tiếng Trung",
          "hán tự",
          "tốt",
          "nghe hay",
          "hay chơi",
          "hạng",
          "uống",
          "trộn",
          "sau",
          "ngày mai mai",
          "hoa",
          "nói",
          "xấu",
          "trả lời",
          "trở về",
          "về lại",
          "về",
          "gặp",
          "tàu",
          "vé máy bay",
          "trứng gà",
          "mấy",
          "ghi",
          "nhớ",
          "người thân",
          "giữa",
          "thấy",
          "gặp mặt",
          "gọi",
          "dạy",
          "nhà học",
          "giới thiệu",
          "chị",
          "chị gái",
          "hôm nay",
          "vào",
          "chín",
          "vừa",
          "cảm thấy",
          "mở",
          "lái xe",
          "đi họp",
          "chăm sóc",
          "đi khám bệnh",
          "nhìn thấy",
          "kiểm tra",
          "kỳ thi",
          "khát",
          "bài",
          "sách giáo khoa",
          "bài đọc",
          "miếng",
          "nhanh",
          "đến",
          "già",
          "thầy",
          "rồi",
          "mệt",
          "lạnh",
          "li",
          "hai",
          "không",
          "tầng",
          "trên tầng",
          "dưới lầu",
          "đường",
          "giao lộ",
          "trên đường",
          "đường",
          "mua",
          "chậm",
          "bận",
          "không",
          "không có",
          "em gái",
          "em gái",
          "vé vào",
          "các",
          "các",
          "bánh",
          "mì",
          "tên",
          "hiểu",
          "năm sau",
          "lấy",
          "ở đâu",
          "nơi nào",
          "ở đó",
          "nơi đó",
          "những",
          "sữa",
          "bà",
          "nam",
          "người đàn ông",
          "nam sinh",
          "phía nam",
          "khó",
          "có thể",
          "bạn",
          "năm",
          "bạn",
          "sữa bò",
          "nữ",
          "con gái",
          "cô gái",
          "nữ nhân",
          "bên cạnh",
          "chạy",
          "vé",
          "khởi",
          "ngủ dậy",
          "bắt đầu",
          "xe hơi",
          "ngày trước ngày qua",
          "tiền",
          "xin",
          "nghỉ phép",
          "xin ngồi",
          "quả bóng",
          "đi",
          "năm ngoái",
          "nóng",
          "người",
          "nghiêm túc",
          "ngày",
          "thịt",
          "ba",
          "núi",
          "siêu thị",
          "cửa hàng",
          "trên",
          "đi làm",
          "lên xe",
          "đến lớp",
          "truy cập",
          "đi học",
          "thân thể",
          "bị bệnh",
          "bực tức",
          "sinh nhật",
          "thời gian",
          "thời gian",
          "việc",
          "thử",
          "là",
          "có phải không",
          "điện thoại",
          "sách",
          "túi xách",
          "cửa hàng sách",
          "cây",
          "ai",
          "nước",
          "trái cây",
          "ngủ",
          "nói",
          "anh",
          "họ",
          "rất",
          "trời",
          "thời tiết",
          "nghe",
          "nghe chép",
          "thư viện",
          "ngoài",
          "ngoài",
          "nước ngoài",
          "ngôn ngữ nước ngoài",
          "chơi",
          "chiều",
          "cơm tối",
          "tối",
          "trực tuyến",
          "người dùng mạng",
          "quên",
          "quên",
          "hỏi",
          "chúng ta",
          "bữa trưa",
          "rửa",
          "phòng xí",
          "thích",
          "tây",
          "xuống",
          "kết thúc công việc",
          "dưới",
          "xuống xe",
          "lần sau",
          "tan hoc",
          "trước",
          "bây giờ",
          "tưởng",
          "nhỏ",
          "giờ",
          "trường tiểu học",
          "học sinh",
          "cười",
          "viết",
          "cảm ơn",
          "mới",
          "thứ bảy",
          "chủ nhật",
          "chủ nhật",
          "đi",
          "nghỉ",
          "học",
          "học sinh",
          "học",
          "trường học",
          "muốn",
          "cũng",
          "trang",
          "một chút",
          "một lúc",
          "cùng nhau",
          "cùng nhau",
          "một chút",
          "giống nhau",
          "bác sĩ",
          "bệnh viện",
          "dùng",
          "có",
          "nổi tiếng",
          "thỉnh thoảng",
          "có ích",
          "phải",
          "phía phải",
          "mưa",
          "nguyên",
          "xa",
          "tháng",
          "lại",
          "tạm biệt",
          "ở",
          "sớm",
          "bữa sáng",
          "sáng sớm",
          "ga",
          "tìm",
          "tìm thấy",
          "ở đây",
          "này",
          "mặc",
          "thật",
          "thật",
          "chính",
          "đang",
          "tri thức",
          "trung",
          "Trung Quốc",
          "tiếng Trung",
          "trưa",
          "trung học",
          "học sinh trung học",
          "nặng",
          "quan trọng",
          "ở",
          "chuẩn bị",
          "bàn",
          "bàn",
          "con",
          "đi",
          "đi bộ",
          "nhất",
          "tốt nhất",
          "cuối cùng",
          "hôm qua",
          "trái",
          "trái",
          "ngồi",
          "ngồi xuống",
          "làm"
        ],
        "native_vietnamese": [
          "thích",
          "tám",
          "nửa ngày",
          "giúp đỡ",
          "cốc",
          "gốc",
          "khác",
          "không",
          "Không sao",
          "không cần",
          "khác",
          "thường",
          "hát",
          "vé",
          "xe",
          "ra",
          "đi ra",
          "đến",
          "đất",
          "nơi",
          "phương",
          "trên mặt đất",
          "em trai",
          "đông",
          "đúng",
          "bao nhiêu",
          "con trai",
          "phòng",
          "nhà",
          "rất",
          "chia",
          "vui",
          "anh trai",
          "một",
          "còn",
          "ngon",
          "xinh",
          "rất",
          "sau",
          "về",
          "về nhà",
          "nhớ",
          "gia đình",
          "nhà",
          "năm nay",
          "vào",
          "vào",
          "đùa",
          "nhìn",
          "cái",
          "đến",
          "người già",
          "trong",
          "sáu",
          "mẹ",
          "mẹ",
          "ngay",
          "không",
          "tóc",
          "Không sao",
          "không sao",
          "không sao",
          "cửa",
          "cửa",
          "cơm",
          "ngày mai",
          "nào",
          "nào",
          "đó",
          "đó",
          "cậu bé",
          "bạn trai",
          "nam",
          "à",
          "các bạn",
          "bạn gái",
          "cô gái",
          "bạn",
          "bảy",
          "trước",
          "trước",
          "túi",
          "xin vào",
          "xin lỗi",
          "biết",
          "ngày",
          "trên",
          "lần trước",
          "sáng",
          "ít",
          "trên người",
          "gì",
          "mười",
          "tay",
          "ngủ",
          "nói",
          "bốn",
          "gửi",
          "tuổi",
          "họ",
          "cô ấy",
          "nghe được",
          "nghe",
          "bạn",
          "tôi",
          "năm",
          "phía tây",
          "chiều",
          "mưa",
          "thầy",
          "trẻ con",
          "chị",
          "trẻ con",
          "tết",
          "trường",
          "ông nội",
          "một",
          "nửa",
          "một bên",
          "một số",
          "đồ mặc",
          "một",
          "thỉnh thoảng",
          "một chút",
          "một chút",
          "một chút",
          "ở nhà",
          "thế nào",
          "này",
          "đây",
          "đây",
          "biết",
          "giữa",
          "chữ",
          "con"
        ],
        "french_loanword": [
          "sân bay"
        ]
      },
      "source_languages": {
        "chinese": 367,
        "unknown": 119,
        "Chinese": 23,
        "french": 1,
        "vietnamese": 1
      }
    },
    "tone_patterns": {
      "tone_distribution": {
        "low_rising": 209,
        "level tone": 2,
        "neutral": 1,
        "high_level": 38,
        "rising": 31,
        "giọng trầm cho cả hai âm": 1,
        "mid_rising": 5,
        "rising then falling-rising tone": 1,
        "high level, high level": 1,
        "flat": 2,
        "low_tone": 15,
        "low_high": 1,
        "level tone, level tone": 2,
        "rising then falling": 1,
        "falling": 44,
        "low_low": 4,
        "low falling then high rising": 1,
        "low_rising, high_falling": 3,
        "high_tone": 6,
        "low": 5,
        "level_tone": 3,
        "rising tone on both syllables": 6,
        "tone3 + tone2": 1,
        "low_falling": 4,
        "falling_tone": 9,
        "low_rising, neutral": 1,
        "high_level_low_falling": 1,
        "low_rising, mid_level": 2,
        "mid_falling": 6,
        "high": 5,
        "low falling then rising": 1,
        "rising_rising": 3,
        "high-level then rising": 1,
        "mid_mid": 3,
        "low_rising, low_rising, high_level": 1,
        "high level tone": 5,
        "low tone": 1,
        "rising then falling-rising": 1,
        "low_flat": 2,
        "high_level_tone": 1,
        "falling_rising_high": 1,
        "level_tone_level_tone_level_tone_level_tone": 1,
        "low then high": 1,
        "low_rising, high": 1,
        "mid_falling_low_rising": 1,
        "low_rising, rising": 1,
        "mid_level": 5,
        "rising_rising_rising": 1,
        "mid_tone": 2,
        "mid tone for both syllables": 1,
        "low_level then rising": 1,
        "rising, falling-rising, rising": 1,
        "high_high": 1,
        "mid-falling tone": 1,
        "falling then high": 1,
        "mid-falling": 1,
        "mid rising": 1,
        "falling_rising": 5,
        "low_rising then high_level": 1,
        "low_rising_high_falling": 1,
        "mid_low": 1,
        "mid-level tones": 1,
        "high_rising": 1,
        "monotonic low tone": 1,
        "low falling then low rising": 1,
        "rising_tone": 2,
        "trầm": 1,
        "level-level": 1,
        "high level": 2,
        "high_level (2) + low_rising (3)": 1,
        "low falling then low": 1,
        "low_tone_falling_tone": 2,
        "low_rising low_rising": 1,
        "low rising then falling": 1,
        "rising, falling-rising, rising, rising": 1,
        "falling then low": 1,
        "low_rising_high_level": 2,
        "falling_low_rising": 1,
        "low_rising (đi) + high_falling (học)": 1,
        "low_level, falling_rising": 1,
        "low_rising, falling_rising": 1,
        "low_rising, low_rising, falling": 1,
        "low_rising_mid_rising": 1,
        "low then high-rising": 1,
        "nghe (low-rising) + chép (high-falling)": 1,
        "low_rising then falling_rising": 1,
        "low_rising, low_rising, low_rising, low_rising": 1,
        "falling_rising_low_rising": 1,
        "rising-falling, high-level": 1,
        "low_rising, mid_level, low_rising": 1,
        "low_rising then falling": 2,
        "low falling": 2,
        "low_rising (phía) + mid_rising (tây)": 1,
        "low_level": 1,
        "ngang": 1,
        "low_level_then_rising": 1,
        "level falling": 1,
        "rising_falling": 1,
        "low_rising_low_rising": 1,
        "mid_high tone": 1,
        "low_rising mid_level": 1,
        "mid-level then falling": 1,
        "falling-rising tone on 'Quốc'": 1,
        "low then mid": 1,
        "low falling - mid rising": 1,
        "low_rising_falling": 1
      },
      "tone_details": {
        "low_rising": [
          "yêu",
          "thích",
          "tám",
          "bố",
          "nửa",
          "bao",
          "cốc",
          "gốc",
          "bản",
          "so sánh",
          "khác",
          "không",
          "khác",
          "hát",
          "hát",
          "mặc",
          "thứ",
          "gọi điện thoại",
          "mở",
          "đánh bóng",
          "lớn",
          "sinh viên đại học",
          "đến",
          "đất",
          "phương",
          "trên mặt đất",
          "nhận được",
          "thứ",
          "thứ",
          "rạp chiếu phim",
          "phía đông",
          "động",
          "hành động",
          "đúng",
          "no",
          "hai",
          "bữa ăn",
          "phòng",
          "thả",
          "nghỉ phép",
          "khô",
          "cao",
          "nói",
          "bài hát",
          "một",
          "cho",
          "đóng",
          "đắt",
          "quốc",
          "vẫn",
          "vẫn",
          "còn",
          "trẻ",
          "hán tự",
          "tốt",
          "hay chơi",
          "hạng",
          "uống",
          "trộn",
          "rất",
          "sau",
          "xấu",
          "trả lời",
          "về lại",
          "gặp",
          "mấy",
          "ghi",
          "giữa",
          "gọi",
          "dạy",
          "nhà học",
          "chị gái",
          "chín",
          "đi họp",
          "đi khám bệnh",
          "nhìn thấy",
          "kỳ thi",
          "khát",
          "bài",
          "bài đọc",
          "miếng",
          "đến",
          "mệt",
          "lạnh",
          "li",
          "hai",
          "tầng",
          "dưới lầu",
          "không",
          "không sao",
          "em gái",
          "cửa",
          "cửa",
          "vé vào",
          "các",
          "các",
          "bánh",
          "mì",
          "hiểu",
          "lấy",
          "ở đâu",
          "đó",
          "ở đó",
          "những",
          "người đàn ông",
          "phía nam",
          "à",
          "bạn",
          "cô gái",
          "nữ nhân",
          "cô gái",
          "chạy",
          "bạn",
          "bảy",
          "khởi",
          "ngủ dậy",
          "xe hơi",
          "trước",
          "trước",
          "nghỉ phép",
          "quả bóng",
          "nóng",
          "ngày",
          "thịt",
          "ba",
          "núi",
          "siêu thị",
          "đến lớp",
          "truy cập",
          "ít",
          "gì",
          "bị bệnh",
          "bực tức",
          "sinh nhật",
          "việc",
          "thử",
          "điện thoại",
          "túi xách",
          "nước",
          "ngủ",
          "bốn",
          "tuổi",
          "anh",
          "họ",
          "bạn",
          "nước ngoài",
          "chơi",
          "tối",
          "tôi",
          "chúng ta",
          "dưới",
          "xuống xe",
          "trước",
          "bây giờ",
          "tưởng",
          "nhỏ",
          "chị",
          "trẻ con",
          "trường tiểu học",
          "học sinh",
          "cười",
          "mới",
          "chủ nhật",
          "chủ nhật",
          "nghỉ",
          "muốn",
          "cũng",
          "ông nội",
          "một",
          "một lúc",
          "một chút",
          "giống nhau",
          "đồ mặc",
          "bác sĩ",
          "có",
          "một",
          "nổi tiếng",
          "thỉnh thoảng",
          "có ích",
          "phải",
          "phía phải",
          "tháng",
          "lại",
          "tạm biệt",
          "ở",
          "sớm",
          "sáng sớm",
          "thế nào",
          "ga",
          "đây",
          "ở đây",
          "này",
          "thật",
          "thật",
          "chính",
          "trung",
          "trưa",
          "trung học",
          "học sinh trung học",
          "nặng",
          "ở",
          "bàn",
          "chữ",
          "con",
          "đi bộ",
          "tốt nhất",
          "trái",
          "trái",
          "ngồi"
        ],
        "level tone": [
          "ba",
          "nam sinh"
        ],
        "neutral": [
          "bar"
        ],
        "high_level": [
          "trắng",
          "ngày",
          "trăm",
          "rau",
          "thường",
          "xe",
          "đông",
          "nhiều",
          "nhà",
          "khép",
          "qua",
          "nhớ",
          "thấy",
          "nhanh",
          "đường",
          "tóc",
          "tên",
          "năm sau",
          "nào",
          "bà",
          "nam",
          "năm",
          "tiền",
          "trên",
          "trên",
          "tay",
          "ai",
          "nói",
          "chiều",
          "quên",
          "hỏi",
          "năm",
          "tây",
          "học",
          "học",
          "trường",
          "bàn",
          "con"
        ],
        "rising": [
          "lớp",
          "giúp",
          "biệt",
          "trà",
          "thường",
          "phim",
          "đều",
          "đọc",
          "theo",
          "sau",
          "hoa",
          "tàu",
          "chị",
          "vào",
          "già",
          "trên đường",
          "Không sao",
          "sữa",
          "vé",
          "túi",
          "mười",
          "là",
          "gửi",
          "nghe",
          "quên",
          "rửa",
          "viết",
          "trang",
          "dùng",
          "một chút",
          "xa"
        ],
        "giọng trầm cho cả hai âm": [
          "nửa năm"
        ],
        "mid_rising": [
          "nửa ngày",
          "gia đình",
          "ngày",
          "thời tiết",
          "đi"
        ],
        "rising then falling-rising tone": [
          "giúp đỡ"
        ],
        "high level, high level": [
          "bánh bao"
        ],
        "flat": [
          "cốc",
          "cậu bé"
        ],
        "low_tone": [
          "bắc",
          "không cần",
          "ra",
          "ra",
          "giường",
          "rất",
          "vào",
          "không",
          "mẹ",
          "bận",
          "nghiêm túc",
          "cây",
          "ngủ",
          "rất",
          "chuẩn bị"
        ],
        "low_high": [
          "phía bắc"
        ],
        "level tone, level tone": [
          "Thành Đô",
          "tan hoc"
        ],
        "rising then falling": [
          "người khác"
        ],
        "falling": [
          "bệnh",
          "không quá",
          "đập",
          "nơi",
          "của",
          "điểm",
          "điện",
          "chia",
          "vui",
          "anhsao",
          "ngon",
          "nói",
          "về",
          "vào",
          "đùa",
          "đến",
          "rồi",
          "trong",
          "đường",
          "cơm",
          "đó",
          "nơi đó",
          "nam",
          "khó",
          "có thể",
          "bạn",
          "đi",
          "biết",
          "sách",
          "nói",
          "nghe",
          "xuống",
          "chiều",
          "mưa",
          "tết",
          "nửa",
          "mưa",
          "tìm",
          "mặc",
          "đang",
          "biết",
          "đi",
          "nhất",
          "làm"
        ],
        "low_low": [
          "bệnh nhân",
          "trở về",
          "trên người",
          "trường học"
        ],
        "low falling then high rising": [
          "không đúng"
        ],
        "low_rising, high_falling": [
          "Không sao",
          "cảm thấy",
          "trái cây"
        ],
        "high_tone": [
          "vé",
          "ăn",
          "không",
          "xin",
          "sáng",
          "này"
        ],
        "low": [
          "xe",
          "gió",
          "nữ",
          "họ",
          "đây"
        ],
        "level_tone": [
          "ga",
          "kết thúc công việc",
          "một số"
        ],
        "rising tone on both syllables": [
          "ăn cơm",
          "nước ngoài",
          "nghe hay",
          "trên tầng",
          "xin ngồi",
          "lên xe"
        ],
        "tone3 + tone2": [
          "đi ra"
        ],
        "low_falling": [
          "theo",
          "sáu",
          "ngay",
          "nguyên"
        ],
        "falling_tone": [
          "sai",
          "em trai",
          "con trai",
          "người thân",
          "nào",
          "bạn trai",
          "đi làm",
          "giữa",
          "hôm qua"
        ],
        "low_rising, neutral": [
          "đi taxi"
        ],
        "high_level_low_falling": [
          "đại học"
        ],
        "low_rising, mid_level": [
          "bản đồ",
          "quốc gia"
        ],
        "mid_falling": [
          "chờ",
          "nhìn",
          "chậm",
          "xin vào",
          "thời gian",
          "bệnh viện"
        ],
        "high": [
          "em",
          "học",
          "nhà",
          "thầy",
          "người"
        ],
        "low falling then rising": [
          "thứ hai"
        ],
        "rising_rising": [
          "điện thoại",
          "tan hoc",
          "tri thức"
        ],
        "high-level then rising": [
          "máy tính"
        ],
        "mid_mid": [
          "ti vi",
          "giới thiệu",
          "cùng nhau"
        ],
        "low_rising, low_rising, high_level": [
          "máy truyền hình"
        ],
        "high level tone": [
          "đồ",
          "sạch",
          "ngoài",
          "ngoài",
          "thích"
        ],
        "low tone": [
          "xin lỗi"
        ],
        "rising then falling-rising": [
          "bao nhiêu"
        ],
        "low_flat": [
          "nhà hàng",
          "em gái"
        ],
        "high_level_tone": [
          "bay"
        ],
        "falling_rising_high": [
          "máy bay"
        ],
        "level_tone_level_tone_level_tone_level_tone": [
          "bạn đang làm gì"
        ],
        "low then high": [
          "anh trai"
        ],
        "low_rising, high": [
          "công nhân"
        ],
        "mid_falling_low_rising": [
          "công việc"
        ],
        "low_rising, rising": [
          "tiếng Trung"
        ],
        "mid_level": [
          "xinh",
          "vừa",
          "mua",
          "trời",
          "thầy"
        ],
        "rising_rising_rising": [
          "ngày mai mai"
        ],
        "mid_tone": [
          "về",
          "lần sau"
        ],
        "mid tone for both syllables": [
          "về nhà"
        ],
        "low_level then rising": [
          "sân bay"
        ],
        "rising, falling-rising, rising": [
          "vé máy bay"
        ],
        "high_high": [
          "trứng gà"
        ],
        "mid-falling tone": [
          "nhớ"
        ],
        "falling then high": [
          "gặp mặt"
        ],
        "mid-falling": [
          "năm nay"
        ],
        "mid rising": [
          "hôm nay"
        ],
        "falling_rising": [
          "mở",
          "không sao",
          "bắt đầu",
          "năm ngoái",
          "một chút"
        ],
        "low_rising then high_level": [
          "lái xe"
        ],
        "low_rising_high_falling": [
          "chăm sóc"
        ],
        "mid_low": [
          "kiểm tra"
        ],
        "mid-level tones": [
          "sách giáo khoa"
        ],
        "high_rising": [
          "cái"
        ],
        "monotonic low tone": [
          "người già"
        ],
        "low falling then low rising": [
          "giao lộ"
        ],
        "rising_tone": [
          "mẹ",
          "trẻ con"
        ],
        "trầm": [
          "không có"
        ],
        "level-level": [
          "ngày mai"
        ],
        "high level": [
          "nơi nào",
          "cảm ơn"
        ],
        "high_level (2) + low_rising (3)": [
          "các bạn"
        ],
        "low falling then low": [
          "sữa bò"
        ],
        "low_tone_falling_tone": [
          "con gái",
          "nghe được"
        ],
        "low_rising low_rising": [
          "bạn gái"
        ],
        "low rising then falling": [
          "bên cạnh"
        ],
        "rising, falling-rising, rising, rising": [
          "ngày trước ngày qua"
        ],
        "falling then low": [
          "xin lỗi"
        ],
        "low_rising_high_level": [
          "cửa hàng",
          "bữa sáng"
        ],
        "falling_low_rising": [
          "lần trước"
        ],
        "low_rising (đi) + high_falling (học)": [
          "đi học"
        ],
        "low_level, falling_rising": [
          "thân thể"
        ],
        "low_rising, falling_rising": [
          "thời gian"
        ],
        "low_rising, low_rising, falling": [
          "có phải không"
        ],
        "low_rising_mid_rising": [
          "cửa hàng sách"
        ],
        "low then high-rising": [
          "cô ấy"
        ],
        "nghe (low-rising) + chép (high-falling)": [
          "nghe chép"
        ],
        "low_rising then falling_rising": [
          "thư viện"
        ],
        "low_rising, low_rising, low_rising, low_rising": [
          "ngôn ngữ nước ngoài"
        ],
        "falling_rising_low_rising": [
          "cơm tối"
        ],
        "rising-falling, high-level": [
          "trực tuyến"
        ],
        "low_rising, mid_level, low_rising": [
          "người dùng mạng"
        ],
        "low_rising then falling": [
          "bữa trưa",
          "một bên"
        ],
        "low falling": [
          "phòng xí",
          "ngồi xuống"
        ],
        "low_rising (phía) + mid_rising (tây)": [
          "phía tây"
        ],
        "low_level": [
          "giờ"
        ],
        "ngang": [
          "thứ bảy"
        ],
        "low_level_then_rising": [
          "học sinh"
        ],
        "level falling": [
          "một chút"
        ],
        "rising_falling": [
          "cùng nhau"
        ],
        "low_rising_low_rising": [
          "thỉnh thoảng"
        ],
        "mid_high tone": [
          "một chút"
        ],
        "low_rising mid_level": [
          "ở nhà"
        ],
        "mid-level then falling": [
          "tìm thấy"
        ],
        "falling-rising tone on 'Quốc'": [
          "Trung Quốc"
        ],
        "low then mid": [
          "tiếng Trung"
        ],
        "low falling - mid rising": [
          "quan trọng"
        ],
        "low_rising_falling": [
          "cuối cùng"
        ]
      }
    },
    "regional_variants": {
      "regional_differences": {
        "north_central": 2,
        "north_south": 3,
        "central_south": 1
      },
      "variant_examples": {
        "north_central": [
          {
            "word": "bao nhiêu",
            "northern": "bao nhiêu",
            "central": "bao nào"
          },
          {
            "word": "xin ngồi",
            "northern": "xin ngồi",
            "central": "xin ngời"
          }
        ],
        "north_south": [
          {
            "word": "bao nhiêu",
            "northern": "bao nhiêu",
            "southern": "bao nào"
          },
          {
            "word": "xin ngồi",
            "northern": "xin ngồi",
            "southern": "xin ngời"
          },
          {
            "word": "Trung Quốc",
            "northern": "Trung Quốc",
            "southern": "Trung Quóc"
          }
        ],
        "central_south": [
          {
            "word": "Trung Quốc",
            "central": "Trung Quốc",
            "southern": "Trung Quóc"
          }
        ]
      }
    },
    "syllable_structure": {
      "syllable_distribution": {
        "1": 301,
        "2": 191,
        "3": 13,
        "4": 6
      },
      "syllable_details": {
        "1": [
          {
            "word": "yêu",
            "syllables": [
              "yêu"
            ]
          },
          {
            "word": "thích",
            "syllables": [
              "thích"
            ]
          },
          {
            "word": "tám",
            "syllables": [
              "tám"
            ]
          },
          {
            "word": "ba",
            "syllables": [
              "ba"
            ]
          },
          {
            "word": "bố",
            "syllables": [
              "bố"
            ]
          },
          {
            "word": "bar",
            "syllables": [
              "bar"
            ]
          },
          {
            "word": "trắng",
            "syllables": [
              "trắng"
            ]
          },
          {
            "word": "ngày",
            "syllables": [
              "ngày"
            ]
          },
          {
            "word": "trăm",
            "syllables": [
              "trăm"
            ]
          },
          {
            "word": "lớp",
            "syllables": [
              "lớp"
            ]
          },
          {
            "word": "nửa",
            "syllables": [
              "nửa"
            ]
          },
          {
            "word": "giúp",
            "syllables": [
              "giúp"
            ]
          },
          {
            "word": "bao",
            "syllables": [
              "bao"
            ]
          },
          {
            "word": "cốc",
            "syllables": [
              "cốc"
            ]
          },
          {
            "word": "cốc",
            "syllables": [
              "cốc"
            ]
          },
          {
            "word": "bắc",
            "syllables": [
              "bắc"
            ]
          },
          {
            "word": "gốc",
            "syllables": [
              "gốc"
            ]
          },
          {
            "word": "bản",
            "syllables": [
              "bản"
            ]
          },
          {
            "word": "biệt",
            "syllables": [
              "biệt"
            ]
          },
          {
            "word": "khác",
            "syllables": [
              "khác"
            ]
          },
          {
            "word": "bệnh",
            "syllables": [
              "bệnh"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "rau",
            "syllables": [
              "rau"
            ]
          },
          {
            "word": "trà",
            "syllables": [
              "trà"
            ]
          },
          {
            "word": "khác",
            "syllables": [
              "khác"
            ]
          },
          {
            "word": "thường",
            "syllables": [
              "thường"
            ]
          },
          {
            "word": "thường",
            "syllables": [
              "thường"
            ]
          },
          {
            "word": "hát",
            "syllables": [
              "hát"
            ]
          },
          {
            "word": "hát",
            "syllables": [
              "hát"
            ]
          },
          {
            "word": "xe",
            "syllables": [
              "xe"
            ]
          },
          {
            "word": "vé",
            "syllables": [
              "vé"
            ]
          },
          {
            "word": "xe",
            "syllables": [
              "xe"
            ]
          },
          {
            "word": "ga",
            "syllables": [
              "ga"
            ]
          },
          {
            "word": "ăn",
            "syllables": [
              "ăn"
            ]
          },
          {
            "word": "ra",
            "syllables": [
              "ra"
            ]
          },
          {
            "word": "ra",
            "syllables": [
              "ra"
            ]
          },
          {
            "word": "mặc",
            "syllables": [
              "mặc"
            ]
          },
          {
            "word": "giường",
            "syllables": [
              "giường"
            ]
          },
          {
            "word": "thứ",
            "syllables": [
              "thứ"
            ]
          },
          {
            "word": "theo",
            "syllables": [
              "theo"
            ]
          },
          {
            "word": "sai",
            "syllables": [
              "sai"
            ]
          },
          {
            "word": "đập",
            "syllables": [
              "đập"
            ]
          },
          {
            "word": "mở",
            "syllables": [
              "mở"
            ]
          },
          {
            "word": "lớn",
            "syllables": [
              "lớn"
            ]
          },
          {
            "word": "đến",
            "syllables": [
              "đến"
            ]
          },
          {
            "word": "đất",
            "syllables": [
              "đất"
            ]
          },
          {
            "word": "nơi",
            "syllables": [
              "nơi"
            ]
          },
          {
            "word": "phương",
            "syllables": [
              "phương"
            ]
          },
          {
            "word": "của",
            "syllables": [
              "của"
            ]
          },
          {
            "word": "chờ",
            "syllables": [
              "chờ"
            ]
          },
          {
            "word": "em",
            "syllables": [
              "em"
            ]
          },
          {
            "word": "thứ",
            "syllables": [
              "thứ"
            ]
          },
          {
            "word": "thứ",
            "syllables": [
              "thứ"
            ]
          },
          {
            "word": "điểm",
            "syllables": [
              "điểm"
            ]
          },
          {
            "word": "điện",
            "syllables": [
              "điện"
            ]
          },
          {
            "word": "phim",
            "syllables": [
              "phim"
            ]
          },
          {
            "word": "đông",
            "syllables": [
              "đông"
            ]
          },
          {
            "word": "đồ",
            "syllables": [
              "đồ"
            ]
          },
          {
            "word": "động",
            "syllables": [
              "động"
            ]
          },
          {
            "word": "đều",
            "syllables": [
              "đều"
            ]
          },
          {
            "word": "đọc",
            "syllables": [
              "đọc"
            ]
          },
          {
            "word": "học",
            "syllables": [
              "học"
            ]
          },
          {
            "word": "đúng",
            "syllables": [
              "đúng"
            ]
          },
          {
            "word": "nhiều",
            "syllables": [
              "nhiều"
            ]
          },
          {
            "word": "no",
            "syllables": [
              "no"
            ]
          },
          {
            "word": "hai",
            "syllables": [
              "hai"
            ]
          },
          {
            "word": "phòng",
            "syllables": [
              "phòng"
            ]
          },
          {
            "word": "nhà",
            "syllables": [
              "nhà"
            ]
          },
          {
            "word": "thả",
            "syllables": [
              "thả"
            ]
          },
          {
            "word": "bay",
            "syllables": [
              "bay"
            ]
          },
          {
            "word": "rất",
            "syllables": [
              "rất"
            ]
          },
          {
            "word": "gió",
            "syllables": [
              "gió"
            ]
          },
          {
            "word": "khô",
            "syllables": [
              "khô"
            ]
          },
          {
            "word": "sạch",
            "syllables": [
              "sạch"
            ]
          },
          {
            "word": "cao",
            "syllables": [
              "cao"
            ]
          },
          {
            "word": "vui",
            "syllables": [
              "vui"
            ]
          },
          {
            "word": "nói",
            "syllables": [
              "nói"
            ]
          },
          {
            "word": "một",
            "syllables": [
              "một"
            ]
          },
          {
            "word": "cho",
            "syllables": [
              "cho"
            ]
          },
          {
            "word": "theo",
            "syllables": [
              "theo"
            ]
          },
          {
            "word": "khép",
            "syllables": [
              "khép"
            ]
          },
          {
            "word": "đóng",
            "syllables": [
              "đóng"
            ]
          },
          {
            "word": "đắt",
            "syllables": [
              "đắt"
            ]
          },
          {
            "word": "quốc",
            "syllables": [
              "quốc"
            ]
          },
          {
            "word": "qua",
            "syllables": [
              "qua"
            ]
          },
          {
            "word": "vẫn",
            "syllables": [
              "vẫn"
            ]
          },
          {
            "word": "vẫn",
            "syllables": [
              "vẫn"
            ]
          },
          {
            "word": "còn",
            "syllables": [
              "còn"
            ]
          },
          {
            "word": "trẻ",
            "syllables": [
              "trẻ"
            ]
          },
          {
            "word": "tốt",
            "syllables": [
              "tốt"
            ]
          },
          {
            "word": "ngon",
            "syllables": [
              "ngon"
            ]
          },
          {
            "word": "xinh",
            "syllables": [
              "xinh"
            ]
          },
          {
            "word": "hạng",
            "syllables": [
              "hạng"
            ]
          },
          {
            "word": "uống",
            "syllables": [
              "uống"
            ]
          },
          {
            "word": "trộn",
            "syllables": [
              "trộn"
            ]
          },
          {
            "word": "rất",
            "syllables": [
              "rất"
            ]
          },
          {
            "word": "sau",
            "syllables": [
              "sau"
            ]
          },
          {
            "word": "sau",
            "syllables": [
              "sau"
            ]
          },
          {
            "word": "hoa",
            "syllables": [
              "hoa"
            ]
          },
          {
            "word": "nói",
            "syllables": [
              "nói"
            ]
          },
          {
            "word": "xấu",
            "syllables": [
              "xấu"
            ]
          },
          {
            "word": "về",
            "syllables": [
              "về"
            ]
          },
          {
            "word": "về",
            "syllables": [
              "về"
            ]
          },
          {
            "word": "gặp",
            "syllables": [
              "gặp"
            ]
          },
          {
            "word": "tàu",
            "syllables": [
              "tàu"
            ]
          },
          {
            "word": "mấy",
            "syllables": [
              "mấy"
            ]
          },
          {
            "word": "ghi",
            "syllables": [
              "ghi"
            ]
          },
          {
            "word": "nhớ",
            "syllables": [
              "nhớ"
            ]
          },
          {
            "word": "nhớ",
            "syllables": [
              "nhớ"
            ]
          },
          {
            "word": "nhà",
            "syllables": [
              "nhà"
            ]
          },
          {
            "word": "giữa",
            "syllables": [
              "giữa"
            ]
          },
          {
            "word": "thấy",
            "syllables": [
              "thấy"
            ]
          },
          {
            "word": "gọi",
            "syllables": [
              "gọi"
            ]
          },
          {
            "word": "dạy",
            "syllables": [
              "dạy"
            ]
          },
          {
            "word": "chị",
            "syllables": [
              "chị"
            ]
          },
          {
            "word": "vào",
            "syllables": [
              "vào"
            ]
          },
          {
            "word": "vào",
            "syllables": [
              "vào"
            ]
          },
          {
            "word": "vào",
            "syllables": [
              "vào"
            ]
          },
          {
            "word": "chín",
            "syllables": [
              "chín"
            ]
          },
          {
            "word": "vừa",
            "syllables": [
              "vừa"
            ]
          },
          {
            "word": "mở",
            "syllables": [
              "mở"
            ]
          },
          {
            "word": "đùa",
            "syllables": [
              "đùa"
            ]
          },
          {
            "word": "nhìn",
            "syllables": [
              "nhìn"
            ]
          },
          {
            "word": "khát",
            "syllables": [
              "khát"
            ]
          },
          {
            "word": "bài",
            "syllables": [
              "bài"
            ]
          },
          {
            "word": "cái",
            "syllables": [
              "cái"
            ]
          },
          {
            "word": "miếng",
            "syllables": [
              "miếng"
            ]
          },
          {
            "word": "nhanh",
            "syllables": [
              "nhanh"
            ]
          },
          {
            "word": "đến",
            "syllables": [
              "đến"
            ]
          },
          {
            "word": "đến",
            "syllables": [
              "đến"
            ]
          },
          {
            "word": "già",
            "syllables": [
              "già"
            ]
          },
          {
            "word": "thầy",
            "syllables": [
              "thầy"
            ]
          },
          {
            "word": "rồi",
            "syllables": [
              "rồi"
            ]
          },
          {
            "word": "mệt",
            "syllables": [
              "mệt"
            ]
          },
          {
            "word": "lạnh",
            "syllables": [
              "lạnh"
            ]
          },
          {
            "word": "li",
            "syllables": [
              "li"
            ]
          },
          {
            "word": "trong",
            "syllables": [
              "trong"
            ]
          },
          {
            "word": "hai",
            "syllables": [
              "hai"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "sáu",
            "syllables": [
              "sáu"
            ]
          },
          {
            "word": "tầng",
            "syllables": [
              "tầng"
            ]
          },
          {
            "word": "đường",
            "syllables": [
              "đường"
            ]
          },
          {
            "word": "mẹ",
            "syllables": [
              "mẹ"
            ]
          },
          {
            "word": "mẹ",
            "syllables": [
              "mẹ"
            ]
          },
          {
            "word": "đường",
            "syllables": [
              "đường"
            ]
          },
          {
            "word": "ngay",
            "syllables": [
              "ngay"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "mua",
            "syllables": [
              "mua"
            ]
          },
          {
            "word": "chậm",
            "syllables": [
              "chậm"
            ]
          },
          {
            "word": "bận",
            "syllables": [
              "bận"
            ]
          },
          {
            "word": "tóc",
            "syllables": [
              "tóc"
            ]
          },
          {
            "word": "không",
            "syllables": [
              "không"
            ]
          },
          {
            "word": "cửa",
            "syllables": [
              "cửa"
            ]
          },
          {
            "word": "cửa",
            "syllables": [
              "cửa"
            ]
          },
          {
            "word": "các",
            "syllables": [
              "các"
            ]
          },
          {
            "word": "các",
            "syllables": [
              "các"
            ]
          },
          {
            "word": "cơm",
            "syllables": [
              "cơm"
            ]
          },
          {
            "word": "bánh",
            "syllables": [
              "bánh"
            ]
          },
          {
            "word": "mì",
            "syllables": [
              "mì"
            ]
          },
          {
            "word": "tên",
            "syllables": [
              "tên"
            ]
          },
          {
            "word": "hiểu",
            "syllables": [
              "hiểu"
            ]
          },
          {
            "word": "lấy",
            "syllables": [
              "lấy"
            ]
          },
          {
            "word": "nào",
            "syllables": [
              "nào"
            ]
          },
          {
            "word": "nào",
            "syllables": [
              "nào"
            ]
          },
          {
            "word": "đó",
            "syllables": [
              "đó"
            ]
          },
          {
            "word": "đó",
            "syllables": [
              "đó"
            ]
          },
          {
            "word": "những",
            "syllables": [
              "những"
            ]
          },
          {
            "word": "sữa",
            "syllables": [
              "sữa"
            ]
          },
          {
            "word": "bà",
            "syllables": [
              "bà"
            ]
          },
          {
            "word": "nam",
            "syllables": [
              "nam"
            ]
          },
          {
            "word": "nam",
            "syllables": [
              "nam"
            ]
          },
          {
            "word": "khó",
            "syllables": [
              "khó"
            ]
          },
          {
            "word": "à",
            "syllables": [
              "à"
            ]
          },
          {
            "word": "bạn",
            "syllables": [
              "bạn"
            ]
          },
          {
            "word": "năm",
            "syllables": [
              "năm"
            ]
          },
          {
            "word": "bạn",
            "syllables": [
              "bạn"
            ]
